//*****************************************************************************
//
//     ファイル読み込みの処理[fileLoader.cpp]
//     Author:Hodaka Niwa
//
//*****************************************************************************
#include "library.h"

//*****************************************************************************
//    マクロ定義
//*****************************************************************************

//*****************************************************************************
//    静的メンバ変数宣言
//*****************************************************************************

//=============================================================================
//    コンストラクタ
//=============================================================================
CFileLoader::CFileLoader(char *pLoadFileName)
{
	// 各種値のクリア
	m_pFile = NULL;                          // ファイルポインタ
	strcpy(m_aLoadFileName, pLoadFileName);  // 読み込むファイル名
}

//=============================================================================
//    デストラクタ
//=============================================================================
CFileLoader::~CFileLoader()
{

}

//=============================================================================
//    生成処理
//=============================================================================
CFileLoader *CFileLoader::Create(char *pLoadFileName)
{
	CFileLoader *pFileLoader = NULL;	// ファイル読み込みクラスへのポインタ
	if (pFileLoader == NULL)
	{
		pFileLoader = new CFileLoader(pLoadFileName);
		if (pFileLoader != NULL)
		{
			// 初期化処理
			if (FAILED(pFileLoader->Init()))
			{
				delete pFileLoader;
				return NULL;
			}
		}
		else
		{
			return NULL;
		}
	}

	return pFileLoader;
}

//=============================================================================
//    初期化処理
//=============================================================================
HRESULT CFileLoader::Init(void)
{
	// ファイルを開く
	if (m_pFile == NULL)
	{
		m_pFile = fopen(m_aLoadFileName, "r");
		if (m_pFile == NULL)
		{// ファイルポインタ取得に失敗
			return E_FAIL;
		}
	}
	else
	{
		return E_FAIL;
	}

	return S_OK;
}

//=============================================================================
//    終了処理
//=============================================================================
void CFileLoader::Uninit(void)
{
	// ファイルを閉じる
	if (m_pFile != NULL)
	{
		fclose(m_pFile);
	}
}

//=============================================================================
//    ファイルから文字列を取得する処理
//=============================================================================
char *CFileLoader::GetString(char *pSrc)
{
	// ファイルから有効な文字列を取得する
	if (m_pFile != NULL)
	{
		strcpy(pSrc, CFunctionLib::ReadLine(m_pFile, pSrc));
	}

	return pSrc;
}

//=============================================================================
//    読み込むファイル名を設定する
//=============================================================================
void CFileLoader::SetLoadfileName(char *pFileName)
{
	strcpy(m_aLoadFileName, pFileName);
}

//=============================================================================
//    読み込むファイル名を取得する
//=============================================================================
char *CFileLoader::GetLoadfileName(void)
{
	return m_aLoadFileName;
}