//*****************************************************************************
//
//     画面エフェクトの処理[screenEffect.h]
//     Author:Hodaka Niwa
//
//*****************************************************************************
#ifndef _SCREENEFFECT_H_
#define _SCREENEFFECT_H_

//*****************************************************************************
//    インクルードファイル
//*****************************************************************************
#include "scene2D.h"

//*****************************************************************************
//    マクロ定義
//*****************************************************************************


//*****************************************************************************
//    前方宣言
//*****************************************************************************

//*****************************************************************************
//    画面エフェクトクラスの定義
//*****************************************************************************
class CScreenEffect : public CScene2D
{
public:     // 誰でもアクセス可能
	CScreenEffect(int nPriority = 3, OBJTYPE objType = OBJTYPE_SCREENEFFECT);
	~CScreenEffect();

	static CScreenEffect *Create(D3DXVECTOR3 pos, D3DXCOLOR col, D3DXVECTOR3 size);

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

protected: // このクラスと派生クラスだけがアクセス可能

private:   // このクラスだけがアクセス可能
	//--------------------
	//	関数
	//--------------------
	void AlphaAdd(void);
};

#endif