//	◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆
//					プレイヤー管理 [player.cpp]
//			Author : Kobayashi_Sho-hei / 小林 将兵
//	◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆　◆
//	---<<#include>>---
#include "player.h"
#include "model.h"
//==============================================
//					コンストラクタ
//==============================================
CPlayer::CPlayer()
{

}

//==============================================
//					デストラクタ
//==============================================
CPlayer::~CPlayer()
{

}

//==============================================
//					生成
//==============================================
CPlayer* CPlayer::Create(char FileName[40])
{
	CPlayer * pPlayer = NULL;
	if (pPlayer == NULL)
	{
		pPlayer = new CPlayer;
		pPlayer->Init(FileName);
	}

	return pPlayer;
}

//==============================================
//					初期化
////==============================================
HRESULT CPlayer::Init(char FileName[40])
{
	CCharacter::Init(FileName);
	return S_OK;
}

//==============================================
//					終了
//==============================================
void CPlayer::Uninit()
{
	CCharacter::Uninit();
}

//==============================================
//					更新
//==============================================
void CPlayer::Update()
{
	CCharacter::Update();

}

//==============================================
//					描画
//==============================================
void CPlayer::Draw()
{
	CCharacter::Draw();
}
