//=============================================================================
//
// 移動タイプのUIの処理 [MoveUI.cpp]
// Author : 佐藤安純　SATOU ASUMI
//
//=============================================================================
#include "moveUI.h"
#include "manager.h"
#include "input.h"
#include "renderer.h"
#include "scene.h"
#include "input.h"
#include "logo.h"
#include "scene2D.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define VECTOR_ZERO		(D3DXVECTOR3(0.0f, 0.0f, 0.0f))	//ベクトルの初期化

//=============================================================================
// 生成処理
//=============================================================================
CMoveUI * CMoveUI::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, LPDIRECT3DTEXTURE9 pTexture)
{
	CMoveUI * pMoveUI = new CMoveUI;

	pMoveUI->Init();
	pMoveUI->Set(pos, size);
	pMoveUI->BindTexture(pTexture);

	return pMoveUI;
}

//=============================================================================
// コンストラクタ
//=============================================================================
CMoveUI::CMoveUI() : CScene2D(6, CScene::OBJTYPE_UI){}

//=============================================================================
// デストラクタ
//=============================================================================
CMoveUI::~CMoveUI(){}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CMoveUI::Init(void)
{
	CScene2D::Init();
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CMoveUI::Uninit()
{
	CScene2D::Uninit();

	//死亡フラグを立てる
	Release();
}

//=============================================================================
// 更新処理
//=============================================================================
void CMoveUI::Update(){}

//=============================================================================
// 描画処理
//=============================================================================
void CMoveUI::Draw()
{
	CScene2D::Draw();
}

//=============================================================================
// 左に移動する
//=============================================================================
void CMoveUI::UpdateMoveLeft(float fMove)
{
	//位置の取得
	D3DXVECTOR3 Pos = CScene2D::GetPos();

	//移動処理
	Pos.x -= fMove;

	//位置設定
	CScene2D::SetPos(Pos, CScene2D::GetOtherPos());
}

//=============================================================================
// 右に移動する
//=============================================================================
void CMoveUI::UpdateMoveRight(float fMove)
{
	//位置の取得
	D3DXVECTOR3 Pos = CScene2D::GetPos();

	//移動処理
	Pos.x += fMove;

	//位置設定
	CScene2D::SetPos(Pos, CScene2D::GetOtherPos());
}

//=============================================================================
// 上に移動する
//=============================================================================
void CMoveUI::UpdateMoveUp(float fMove)
{
	//位置の取得
	D3DXVECTOR3 Pos = CScene2D::GetPos();

	//移動処理
	Pos.y -= fMove;

	//位置設定
	CScene2D::SetPos(Pos, CScene2D::GetOtherPos());
}

//=============================================================================
// 下に移動する
//=============================================================================
void CMoveUI::UpdateMoveDown(float fMove)
{
	//位置の取得
	D3DXVECTOR3 Pos = CScene2D::GetPos();

	//移動処理
	Pos.y += fMove;

	//位置設定
	CScene2D::SetPos(Pos, CScene2D::GetOtherPos());
}

//=============================================================================
// 拡大処理
//=============================================================================
void CMoveUI::UpdateScaleUp(D3DXVECTOR3 AimSize, D3DXVECTOR2 Move)
{
	//サイズの取得
	D3DXVECTOR3 Size = CScene2D::GetSize();

	//Xのサイズ設定
	if (Size.x < AimSize.x)
	{
		Size.x += Move.x;
	}
	else
	{
		Size.x = AimSize.x;
	}

	//Yのサイズ設定
	if (Size.y < AimSize.y)
	{
		Size.y += Move.y;
	}
	else
	{
		Size.y = AimSize.y;
	}

	//サイズの設定
	CScene2D::SetSize(Size);
}

//=============================================================================
//	縮小処理
//=============================================================================
void CMoveUI::UpdateScaleDown(D3DXVECTOR3 AimSize, D3DXVECTOR2 Move)
{
	//サイズの取得
	D3DXVECTOR3 Size = CScene2D::GetSize();

	//Xのサイズ設定
	if (Size.x > AimSize.x)
	{
		Size.x -= Move.x;
	}
	else
	{
		Size.x = AimSize.x;
	}

	//Yのサイズ設定
	if (Size.y > AimSize.y)
	{
		Size.y -= Move.y;
	}
	else
	{
		Size.y = AimSize.y;
	}

	//サイズの設定
	CScene2D::SetSize(Size);
}