//=============================================================================
//
// セレクト処理 [select.h]
// Author : 佐藤 安純
//
//=============================================================================
#ifndef _SELECT_H_
#define _SELECT_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//=================================
// セレクトクラス
//=================================
class CSelect
{
public:
	CSelect();							// コンストラクタ
	~CSelect();							// デストラクタ
	HRESULT Init();							// 初期化処理
	void	Uninit(void);					// 終了処理
	void	Update(void);					// 更新処理
	void	Draw(void);						// 描画処理

private:
	void LoadUI(void);

	LPDIRECT3DTEXTURE9 * m_ppTexture;		// テクスチャのポインタへのポインタ
	int					m_nMaxTexture;		// 読み込むテクスチャの最大数
};
#endif