//=============================================================================
//
// チュートリアルの処理 [tutorial.cpp]
// Author : 佐藤 安純
//
//=============================================================================
#include "tutorial.h"
#include "main.h"
#include "renderer.h"
#include "manager.h"
#include "input.h"
#include "fade.h"
#include "sound.h"
#include "loadText.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define LOAD_UI		("data\\TEXT\\UI\\Tutorial.txt")

//*****************************************************************************
// 静的メンバ変数宣言
//*****************************************************************************

//=============================================================================
// デフォルトコンストラクタ
//=============================================================================
CTutorial::CTutorial(){}

//=============================================================================
// デストラクタ
//=============================================================================
CTutorial::~CTutorial(){}

//=============================================================================
// 初期化処理
//=============================================================================
void CTutorial::Init(void)
{
	//ベースの初期化
	CModeBase::Init();

	//UI情報の読み込み
	LoadUI(LOAD_UI);
}

//=============================================================================
// 終了処理
//=============================================================================
void CTutorial::Uninit(void)
{
	//ベースの破棄
	CModeBase::Uninit();

	//フェード以外削除
	CScene::ReleaseFade();
}

//=============================================================================
// 更新処理
//=============================================================================
void CTutorial::Update(void)
{
	//インプットの取得　
	CGamePad	*pGamePad = CManager::GetInputGamePad();
	CInputKeyboard * pKeyboard = CManager::GetInputkeyboard();
	CInputXPad * pXPad = CManager::GetXPad();

	if (pKeyboard->GetKeyboardTrigger(DIK_RETURN) == true || pXPad->GetTrigger(XINPUT_GAMEPAD_B, 0) == true)
	{//タイトルからゲームへ
		if (CFade::GetFadeMode() != CFade::FADE_OUT){ CFade::SetFade(CManager::MODE_GAME); }
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void CTutorial::Draw(void)
{
	CScene::DrawAll();
}